oreganko/MP3_STM32/main.c

/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * This notice applies to any and all portions of this file
 * that are not between comment pairs USER CODE BEGIN and
 * USER CODE END. Other portions of this file, whether 
 * inserted by the user or by software development tools
 * are owned by their respective copyright owners.
 *
 * Copyright (c) 2018 STMicroelectronics International N.V. 
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without 
 * modification, are permitted, provided that the following conditions are met:
 *
 * 1. Redistribution of source code must retain the above copyright notice, 
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. Neither the name of STMicroelectronics nor the names of other 
 *    contributors to this software may be used to endorse or promote products 
 *    derived from this software without specific written permission.
 * 4. This software, including modifications and/or derivative works of this 
 *    software, must execute solely and exclusively on microcontroller or
 *    microprocessor devices manufactured by or for STMicroelectronics.
 * 5. Redistribution and use of this software other than as permitted under 
 *    this license is void and will automatically terminate your rights under 
 *    this license. 
 *
 * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
 * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
 * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
 * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
 * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
        #include "stm32f7xx_hal.h"
        #include "cmsis_os.h"
        #include "fatfs.h"
        #include "lwip.h"
        #include "usb_host.h"
		#include "mp3dec.h"

        /* USER CODE BEGIN Includes */
        #include  <errno.h>
        #include  <sys/unistd.h>

        #include "stm32746g_discovery_lcd.h"
        #include "Utilities/Fonts/fonts.h"
        #include "stm32746g_discovery_ts.h"
        #include "stm32746g_discovery_audio.h"
        #include "term_io.h"
        #include "dbgu.h"
        #include "ansi.h"

        #include "FreeRTOS.h"
        #include "task.h"
        #include "queue.h"

        #include "lwip/opt.h"
        #include "lwip/api.h"
        #include "lwip/apps/fs.h"
        #include "lwip/dhcp.h"
        #include "lwip/tcpip.h"
        #include "lwip/netdb.h"
        #include "lwip/sockets.h"
		#include "ff.h"
        #include "lwip.h"

        #include "wm8994/wm8994.h"




        /* USER CODE END Includes */

        /* Private variables ---------------------------------------------------------*/
        ADC_HandleTypeDef hadc3;

        CRC_HandleTypeDef hcrc;

        DCMI_HandleTypeDef hdcmi;

        DMA2D_HandleTypeDef hdma2d;

        I2C_HandleTypeDef hi2c1;
        I2C_HandleTypeDef hi2c3;

        LTDC_HandleTypeDef hltdc;

        QSPI_HandleTypeDef hqspi;

        RTC_HandleTypeDef hrtc;

        SAI_HandleTypeDef hsai_BlockA2;
        SAI_HandleTypeDef hsai_BlockB2;

        SD_HandleTypeDef hsd1;

        SPDIFRX_HandleTypeDef hspdif;

        SPI_HandleTypeDef hspi2;

        TIM_HandleTypeDef htim1;
        TIM_HandleTypeDef htim2;
        TIM_HandleTypeDef htim3;
        TIM_HandleTypeDef htim5;
        TIM_HandleTypeDef htim7;
        TIM_HandleTypeDef htim8;
        TIM_HandleTypeDef htim12;

        UART_HandleTypeDef huart1;
        UART_HandleTypeDef huart6;

        SDRAM_HandleTypeDef hsdram1;

        osThreadId defaultTaskHandle;

        /* USER CODE BEGIN PV */
        /* Private variables ---------------------------------------------------------*/

        /* USER CODE END PV */

        /* Private function prototypes -----------------------------------------------*/
        void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC3_Init(void);
static void MX_CRC_Init(void);
static void MX_DCMI_Init(void);
static void MX_DMA2D_Init(void);
static void MX_FMC_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C3_Init(void);
static void MX_LTDC_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_RTC_Init(void);
static void MX_SAI2_Init(void);
static void MX_SDMMC1_SD_Init(void);
static void MX_SPDIFRX_Init(void);
static void MX_SPI2_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM5_Init(void);
static void MX_TIM8_Init(void);
static void MX_TIM12_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_TIM7_Init(void);
        void StartDefaultTask(void const * argument);

        void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);





        /* USER CODE BEGIN PFP */
        /* Private function prototypes -----------------------------------------------*/

        /* USER CODE END PFP */

        /* USER CODE BEGIN 0 */
        void mainTask(void* p);

        osThreadId netconn_thread_handle;

        #define LCD_X_SIZE      RK043FN48H_WIDTH
        #define LCD_Y_SIZE      RK043FN48H_HEIGHT
static uint32_t lcd_image_fg[LCD_Y_SIZE][LCD_X_SIZE] __attribute__((section(".sdram"))) __attribute__((unused));
static uint32_t lcd_image_bg[LCD_Y_SIZE][LCD_X_SIZE] __attribute__((section(".sdram"))) __attribute__((unused));

