oreganko/MP3_STM32/main.c
        #define MASS_STORAGE_BUF_SIZE		( 1024 * 1024 )
static uint32_t mass_storage_buf[MASS_STORAGE_BUF_SIZE] __attribute__((section(".sdram"))) __attribute__((unused));

        #define PRINTF_USES_HAL_TX    0
        #define ENABLE_NETWORK        0

        int __io_putchar(int ch)
        {
        uint8_t data = ch;
        #if PRINTF_USES_HAL_TX
        HAL_StatusTypeDef status = HAL_UART_Transmit(&huart1, (uint8_t*)&data, len, 100);
        #else
        while(__HAL_UART_GET_FLAG(&huart1, UART_FLAG_TXE) == RESET) { ; }
        huart1.Instance->TDR = (uint16_t)data;
        #endif
        return 0;
        }

        char inkey(void)
        {
        uint32_t flags = huart1.Instance->ISR;

        if((flags & UART_FLAG_RXNE) || (flags & UART_FLAG_ORE))
        {
        __HAL_UART_CLEAR_OREFLAG(&huart1);
        return (huart1.Instance->RDR);
        }
        else
        return 0;
        }

//partially based on available code examples
static void lcd_start(void)
        {
        /* LCD Initialization */
        BSP_LCD_Init();

        /* LCD Initialization */
        BSP_LCD_LayerDefaultInit(0, (unsigned int)lcd_image_bg);
        //BSP_LCD_LayerDefaultInit(1, (unsigned int)lcd_image_bg+(LCD_X_SIZE*LCD_Y_SIZE*4));
        BSP_LCD_LayerDefaultInit(1, (unsigned int)lcd_image_fg);

        /* Enable the LCD */
        BSP_LCD_DisplayOn();

        /* Select the LCD Background Layer  */
        BSP_LCD_SelectLayer(0);

        /* Clear the Background Layer */
        BSP_LCD_Clear(LCD_COLOR_WHITE);
        BSP_LCD_SetBackColor(LCD_COLOR_WHITE);

        BSP_LCD_SetColorKeying(1,LCD_COLOR_WHITE);

        /* Select the LCD Foreground Layer  */
        BSP_LCD_SelectLayer(1);

        /* Clear the Foreground Layer */
        BSP_LCD_Clear(LCD_COLOR_WHITE);
        BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
  
  /* Configure the transparency for foreground and background :
     Increase the transparency */
        BSP_LCD_SetTransparency(0, 255);
        BSP_LCD_SetTransparency(1, 255);
        }


        Point trianglePoints[3];
        Point rectanglePoints[4];

        void draw_triangle(int X0, int Y0, int X1, int Y1, int X2, int Y2) {
        trianglePoints[0].X = X0;
        trianglePoints[0].Y = Y0;
        trianglePoints[1].X = X1;
        trianglePoints[1].Y = Y1;
        trianglePoints[2].X = X2;
        trianglePoints[2].Y = Y2;
        BSP_LCD_FillPolygon(trianglePoints, 3);
        }

        void draw_rectangle(int X0, int Y0, int X1, int Y1, int X2, int Y2, int X3, int Y3) {
        rectanglePoints[0].X = X0;
        rectanglePoints[0].Y = Y0;
        rectanglePoints[1].X = X1;
        rectanglePoints[1].Y = Y1;
        rectanglePoints[3].X = X2;
        rectanglePoints[3].Y = Y2;
        rectanglePoints[2].X = X3;
        rectanglePoints[2].Y = Y3;
        BSP_LCD_FillPolygon(rectanglePoints, 4);
        }

        void draw_empty_rectangle(int X0, int Y0, int X1, int Y1, int X2, int Y2, int X3, int Y3) {
        rectanglePoints[0].X = X0;
        rectanglePoints[0].Y = Y0;
        rectanglePoints[1].X = X1;
        rectanglePoints[1].Y = Y1;
        rectanglePoints[3].X = X2;
        rectanglePoints[3].Y = Y2;
        rectanglePoints[2].X = X3;
        rectanglePoints[2].Y = Y3;
        BSP_LCD_DrawPolygon(rectanglePoints, 4);
        }


        void draw_central_circle(){
        uint16_t circleXpos = 0.5 * LCD_X_SIZE;
        uint16_t circleYpos = 0.5 * LCD_Y_SIZE;
        int R = 70;
        BSP_LCD_FillCircle(circleXpos, circleYpos, R);
        }

        void draw_start_pause(int background_color, int foreground_color){
        /* Select the LCD Background Layer  */
        BSP_LCD_SelectLayer(0);
        BSP_LCD_SetTextColor(background_color);
        draw_central_circle();

        //select Foreground Layer
        BSP_LCD_SelectLayer(1);
        BSP_LCD_SetTextColor(foreground_color);
        draw_triangle(240, 136, 200, 111, 200, 161);
        draw_rectangle(256, 111, 262, 111, 256, 161, 262, 161);
        draw_rectangle(270, 111, 276, 111, 270, 161, 276, 161);

        }

        void draw_current_volume(int volume){
        BSP_LCD_SelectLayer(1);
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		draw_rectangle(440, 36, 460, 36, 440, 236, 460, 236);
        BSP_LCD_SetTextColor(LCD_COLOR_DARKGREEN);
        draw_rectangle(440, 236 - (volume*2), 460, 236 - (volume*2), 440, 236, 460, 236);
        draw_empty_rectangle(440, 36, 460, 36, 440, 236, 460, 236);
        }

static TS_StateTypeDef  TS_State;


        int initialize_touchscreen(void)
        {
        uint8_t  status = 0;
        status = BSP_TS_Init(BSP_LCD_GetXSize(), BSP_LCD_GetYSize());
        if(status != TS_OK) return -1;
        return 0;
        }

//funkcja sprawdzajaca czy x jest w podanym zakresie //jak nie dziala to zmienic int na bool (dodac biblioteke?)
int inRange(unsigned low, unsigned high, unsigned x)
{
return (low <= x && x <= high);
}

 //globalne "zakresy"
int x0 = 40, x1 = 82, x2 = 120, x3 = 150, x4 = 0.5 * LCD_X_SIZE - 70,
x5 = 0.5 * LCD_X_SIZE + 70, x6 = 330, x7 = 360, x8 = 400, x9 = 425;
int y0 = 36, y1 = 0.5 * LCD_Y_SIZE - 70, y2 = 56, y3 = 115,
y4 = 157, y5 = 0.5 * LCD_Y_SIZE + 70, y6 = 216, y7 = 236;


//zmieniona na globalne funkcja rysujaca
void draw_play_background(int first_color, int second_color){
    //draw_start_pause(LCD_COLOR_DARKGREEN, LCD_COLOR_GREEN);
	draw_start_pause(first_color, second_color);
    //drawing forward/backward buttons
    BSP_LCD_SelectLayer(1);
    BSP_LCD_SetTextColor(first_color);
    draw_triangle(x6, y3, x7, 136, x6, y4);
    draw_triangle(x3, y3, x2, 136, x3, y4);
    //draw volume status
    draw_current_volume(70);
    //draw volume buttons
    draw_triangle(x9, y6, x8, y6, 412, y7);
    draw_triangle(x9, y2, x8, y2, 412, y0);
    //draw stop button
    BSP_LCD_SetTextColor(LCD_COLOR_RED);
    draw_rectangle(x0, y3, x1, y3, x0, y4, x1, y4);
}

void draw_playing_background() {
	draw_play_background(LCD_COLOR_DARKGREEN, LCD_COLOR_GREEN);
	}
	
