oreganko/MP3_STM32/main.c
void draw_stopped_background() {
	draw_play_background(LCD_COLOR_ORANGE, LCD_COLOR_DARKYELLOW);
	}

        /* USER CODE END 0 */

/**
 * @brief  The application entry point.
 *
 * @retval None
 */
        int main(void)
        {
        /* USER CODE BEGIN 1 */

        /* USER CODE END 1 */

        /* MCU Configuration----------------------------------------------------------*/

        /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
        HAL_Init();

        /* USER CODE BEGIN Init */

        /* USER CODE END Init */

        /* Configure the system clock */
        SystemClock_Config();

        /* USER CODE BEGIN SysInit */

        /* USER CODE END SysInit */

        /* Initialize all configured peripherals */
        MX_GPIO_Init();
        MX_ADC3_Init();
        MX_CRC_Init();
        MX_DCMI_Init();
        MX_DMA2D_Init();
        MX_FMC_Init();
        MX_I2C1_Init();
        MX_I2C3_Init();
        MX_LTDC_Init();
        MX_QUADSPI_Init();
        MX_RTC_Init();
        MX_SAI2_Init();
        MX_SDMMC1_SD_Init();
        MX_SPDIFRX_Init();
        MX_SPI2_Init();
        MX_TIM1_Init();
        MX_TIM2_Init();
        MX_TIM3_Init();
        MX_TIM5_Init();
        MX_TIM8_Init();
        MX_TIM12_Init();
        MX_USART1_UART_Init();
        MX_USART6_UART_Init();
        MX_TIM7_Init();
        /* USER CODE BEGIN 2 */
        debug_init(&huart1);

        xprintf(ANSI_FG_GREEN "STM32F746 Discovery Project" ANSI_FG_DEFAULT "\n");

        printf("Regular printf\n");

        lcd_start();
        draw_stopped_background();
        initialize_touchscreen();

        /* USER CODE END 2 */

        /* USER CODE BEGIN RTOS_MUTEX */
        /* add mutexes, ... */
        /* USER CODE END RTOS_MUTEX */

        /* USER CODE BEGIN RTOS_SEMAPHORES */
        /* add semaphores, ... */
        /* USER CODE END RTOS_SEMAPHORES */

        /* USER CODE BEGIN RTOS_TIMERS */
        /* start timers, add new ones, ... */
        /* USER CODE END RTOS_TIMERS */

        /* Create the thread(s) */
        /* definition and creation of defaultTask */
        osThreadDef(defaultTask, StartDefaultTask, osPriorityNormal, 0, 4096);
        defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

        /* USER CODE BEGIN RTOS_THREADS */
        /* add threads, ... */
        /* USER CODE END RTOS_THREADS */

        /* USER CODE BEGIN RTOS_QUEUES */
        /* add queues, ... */
        /* USER CODE END RTOS_QUEUES */


        /* Start scheduler */
        osKernelStart();

        /* We should never get here as control is now taken by the scheduler */

        /* Infinite loop */
        /* USER CODE BEGIN WHILE */
        while (1)
        {

        /* USER CODE END WHILE */

        /* USER CODE BEGIN 3 */

        }
        /* USER CODE END 3 */

        }

/**
 * @brief System Clock Configuration
 * @retval None
 */
        void SystemClock_Config(void)
        {

        RCC_OscInitTypeDef RCC_OscInitStruct;
        RCC_ClkInitTypeDef RCC_ClkInitStruct;
        RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;

        /**Configure the main internal regulator output voltage 
         */
        __HAL_RCC_PWR_CLK_ENABLE();

        __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

        /**Initializes the CPU, AHB and APB busses clocks 
         */
        RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_HSE;
        RCC_OscInitStruct.HSEState = RCC_HSE_ON;
        RCC_OscInitStruct.LSIState = RCC_LSI_ON;
        RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
        RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
        RCC_OscInitStruct.PLL.PLLM = 25;
        RCC_OscInitStruct.PLL.PLLN = 400;
        RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
        RCC_OscInitStruct.PLL.PLLQ = 8;
        if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        /**Activate the Over-Drive mode 
         */
        if (HAL_PWREx_EnableOverDrive() != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        /**Initializes the CPU, AHB and APB busses clocks 
         */
        RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
        |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
        RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
        RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
        RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
        RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

        if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_6) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SPDIFRX|RCC_PERIPHCLK_LTDC
        |RCC_PERIPHCLK_RTC|RCC_PERIPHCLK_USART1
        |RCC_PERIPHCLK_USART6|RCC_PERIPHCLK_SAI2
        |RCC_PERIPHCLK_I2C1|RCC_PERIPHCLK_I2C3
        |RCC_PERIPHCLK_SDMMC1|RCC_PERIPHCLK_CLK48;
        PeriphClkInitStruct.PLLI2S.PLLI2SN = 100;
        PeriphClkInitStruct.PLLI2S.PLLI2SP = RCC_PLLP_DIV2;
        PeriphClkInitStruct.PLLI2S.PLLI2SR = 2;
        PeriphClkInitStruct.PLLI2S.PLLI2SQ = 2;
        PeriphClkInitStruct.PLLSAI.PLLSAIN = 192;
        PeriphClkInitStruct.PLLSAI.PLLSAIR = 4;
        PeriphClkInitStruct.PLLSAI.PLLSAIQ = 4;
        PeriphClkInitStruct.PLLSAI.PLLSAIP = RCC_PLLSAIP_DIV4;
        PeriphClkInitStruct.PLLI2SDivQ = 1;
        PeriphClkInitStruct.PLLSAIDivQ = 1;
        PeriphClkInitStruct.PLLSAIDivR = RCC_PLLSAIDIVR_8;
        PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;
        PeriphClkInitStruct.Sai2ClockSelection = RCC_SAI2CLKSOURCE_PLLSAI;
        PeriphClkInitStruct.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK2;
        PeriphClkInitStruct.Usart6ClockSelection = RCC_USART6CLKSOURCE_PCLK2;
        PeriphClkInitStruct.I2c1ClockSelection = RCC_I2C1CLKSOURCE_PCLK1;
        PeriphClkInitStruct.I2c3ClockSelection = RCC_I2C3CLKSOURCE_PCLK1;
        PeriphClkInitStruct.Clk48ClockSelection = RCC_CLK48SOURCE_PLLSAIP;
        PeriphClkInitStruct.Sdmmc1ClockSelection = RCC_SDMMC1CLKSOURCE_CLK48;
        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        /**Configure the Systick interrupt time 
         */
        HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

        /**Configure the Systick 
         */
        HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

        /* SysTick_IRQn interrupt configuration */
        HAL_NVIC_SetPriority(SysTick_IRQn, 15, 0);
        }

