oreganko/MP3_STM32/main.c
/* ADC3 init function */
static void MX_ADC3_Init(void)
        {

        ADC_ChannelConfTypeDef sConfig;

        /**Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion) 
         */
        hadc3.Instance = ADC3;
        hadc3.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;
        hadc3.Init.Resolution = ADC_RESOLUTION_12B;
        hadc3.Init.ScanConvMode = ADC_SCAN_DISABLE;
        hadc3.Init.ContinuousConvMode = DISABLE;
        hadc3.Init.DiscontinuousConvMode = DISABLE;
        hadc3.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
        hadc3.Init.ExternalTrigConv = ADC_SOFTWARE_START;
        hadc3.Init.DataAlign = ADC_DATAALIGN_RIGHT;
        hadc3.Init.NbrOfConversion = 1;
        hadc3.Init.DMAContinuousRequests = DISABLE;
        hadc3.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
        if (HAL_ADC_Init(&hadc3) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        /**Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time. 
         */
        sConfig.Channel = ADC_CHANNEL_4;
        sConfig.Rank = ADC_REGULAR_RANK_1;
        sConfig.SamplingTime = ADC_SAMPLETIME_3CYCLES;
        if (HAL_ADC_ConfigChannel(&hadc3, &sConfig) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        }

/* CRC init function */
static void MX_CRC_Init(void)
        {

        hcrc.Instance = CRC;
        hcrc.Init.DefaultPolynomialUse = DEFAULT_POLYNOMIAL_ENABLE;
        hcrc.Init.DefaultInitValueUse = DEFAULT_INIT_VALUE_ENABLE;
        hcrc.Init.InputDataInversionMode = CRC_INPUTDATA_INVERSION_NONE;
        hcrc.Init.OutputDataInversionMode = CRC_OUTPUTDATA_INVERSION_DISABLE;
        hcrc.InputDataFormat = CRC_INPUTDATA_FORMAT_BYTES;
        if (HAL_CRC_Init(&hcrc) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        }

/* DCMI init function */
static void MX_DCMI_Init(void)
        {

        hdcmi.Instance = DCMI;
        hdcmi.Init.SynchroMode = DCMI_SYNCHRO_HARDWARE;
        hdcmi.Init.PCKPolarity = DCMI_PCKPOLARITY_FALLING;
        hdcmi.Init.VSPolarity = DCMI_VSPOLARITY_LOW;
        hdcmi.Init.HSPolarity = DCMI_HSPOLARITY_LOW;
        hdcmi.Init.CaptureRate = DCMI_CR_ALL_FRAME;
        hdcmi.Init.ExtendedDataMode = DCMI_EXTEND_DATA_8B;
        hdcmi.Init.JPEGMode = DCMI_JPEG_DISABLE;
        hdcmi.Init.ByteSelectMode = DCMI_BSM_ALL;
        hdcmi.Init.ByteSelectStart = DCMI_OEBS_ODD;
        hdcmi.Init.LineSelectMode = DCMI_LSM_ALL;
        hdcmi.Init.LineSelectStart = DCMI_OELS_ODD;
        if (HAL_DCMI_Init(&hdcmi) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        }

/* DMA2D init function */
static void MX_DMA2D_Init(void)
        {

        hdma2d.Instance = DMA2D;
        hdma2d.Init.Mode = DMA2D_M2M;
        hdma2d.Init.ColorMode = DMA2D_OUTPUT_ARGB8888;
        hdma2d.Init.OutputOffset = 0;
        hdma2d.LayerCfg[1].InputOffset = 0;
        hdma2d.LayerCfg[1].InputColorMode = DMA2D_INPUT_ARGB8888;
        hdma2d.LayerCfg[1].AlphaMode = DMA2D_NO_MODIF_ALPHA;
        hdma2d.LayerCfg[1].InputAlpha = 0;
        if (HAL_DMA2D_Init(&hdma2d) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        if (HAL_DMA2D_ConfigLayer(&hdma2d, 1) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        }

/* I2C1 init function */
static void MX_I2C1_Init(void)
        {

        hi2c1.Instance = I2C1;
        hi2c1.Init.Timing = 0x00C0EAFF;
        hi2c1.Init.OwnAddress1 = 0;
        hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
        hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
        hi2c1.Init.OwnAddress2 = 0;
        hi2c1.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
        hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
        hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
        if (HAL_I2C_Init(&hi2c1) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        /**Configure Analogue filter 
         */
        if (HAL_I2CEx_ConfigAnalogFilter(&hi2c1, I2C_ANALOGFILTER_ENABLE) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        /**Configure Digital filter 
         */
        if (HAL_I2CEx_ConfigDigitalFilter(&hi2c1, 0) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        }

/* I2C3 init function */
static void MX_I2C3_Init(void)
        {

        hi2c3.Instance = I2C3;
        hi2c3.Init.Timing = 0x00C0EAFF;
        hi2c3.Init.OwnAddress1 = 0;
        hi2c3.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
        hi2c3.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
        hi2c3.Init.OwnAddress2 = 0;
        hi2c3.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
        hi2c3.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
        hi2c3.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
        if (HAL_I2C_Init(&hi2c3) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        /**Configure Analogue filter 
         */
        if (HAL_I2CEx_ConfigAnalogFilter(&hi2c3, I2C_ANALOGFILTER_ENABLE) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        /**Configure Digital filter 
         */
        if (HAL_I2CEx_ConfigDigitalFilter(&hi2c3, 0) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        }

/* LTDC init function */
static void MX_LTDC_Init(void)
        {

        LTDC_LayerCfgTypeDef pLayerCfg;

        hltdc.Instance = LTDC;
        hltdc.Init.HSPolarity = LTDC_HSPOLARITY_AL;
        hltdc.Init.VSPolarity = LTDC_VSPOLARITY_AL;
        hltdc.Init.DEPolarity = LTDC_DEPOLARITY_AL;
        hltdc.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
        hltdc.Init.HorizontalSync = 40;
        hltdc.Init.VerticalSync = 9;
        hltdc.Init.AccumulatedHBP = 53;
        hltdc.Init.AccumulatedVBP = 11;
        hltdc.Init.AccumulatedActiveW = 533;
        hltdc.Init.AccumulatedActiveH = 283;
        hltdc.Init.TotalWidth = 565;
        hltdc.Init.TotalHeigh = 285;
        hltdc.Init.Backcolor.Blue = 0;
        hltdc.Init.Backcolor.Green = 0;
        hltdc.Init.Backcolor.Red = 0;
        if (HAL_LTDC_Init(&hltdc) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        pLayerCfg.WindowX0 = 0;
        pLayerCfg.WindowX1 = 480;
        pLayerCfg.WindowY0 = 0;
        pLayerCfg.WindowY1 = 272;
        pLayerCfg.PixelFormat = LTDC_PIXEL_FORMAT_ARGB8888;
        pLayerCfg.Alpha = 255;
        pLayerCfg.Alpha0 = 0;
        pLayerCfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
        pLayerCfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
        pLayerCfg.FBStartAdress = 0xC0000000;
        pLayerCfg.ImageWidth = 480;
        pLayerCfg.ImageHeight = 272;
        pLayerCfg.Backcolor.Blue = 0;
        pLayerCfg.Backcolor.Green = 0;
        pLayerCfg.Backcolor.Red = 0;
        if (HAL_LTDC_ConfigLayer(&hltdc, &pLayerCfg, 0) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

