oreganko/MP3_STM32/main.c
        }

/* QUADSPI init function */
static void MX_QUADSPI_Init(void)
        {

        /* QUADSPI parameter configuration*/
        hqspi.Instance = QUADSPI;
        hqspi.Init.ClockPrescaler = 255;
        hqspi.Init.FifoThreshold = 1;
        hqspi.Init.SampleShifting = QSPI_SAMPLE_SHIFTING_NONE;
        hqspi.Init.FlashSize = 1;
        hqspi.Init.ChipSelectHighTime = QSPI_CS_HIGH_TIME_1_CYCLE;
        hqspi.Init.ClockMode = QSPI_CLOCK_MODE_0;
        hqspi.Init.FlashID = QSPI_FLASH_ID_1;
        hqspi.Init.DualFlash = QSPI_DUALFLASH_DISABLE;
        if (HAL_QSPI_Init(&hqspi) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        }

/* RTC init function */
static void MX_RTC_Init(void)
        {

        /* USER CODE BEGIN RTC_Init 0 */

        /* USER CODE END RTC_Init 0 */

        RTC_TimeTypeDef sTime;
        RTC_DateTypeDef sDate;
        RTC_AlarmTypeDef sAlarm;

        /* USER CODE BEGIN RTC_Init 1 */

        /* USER CODE END RTC_Init 1 */

        /**Initialize RTC Only 
         */
        hrtc.Instance = RTC;
        hrtc.Init.HourFormat = RTC_HOURFORMAT_24;
        hrtc.Init.AsynchPrediv = 127;
        hrtc.Init.SynchPrediv = 255;
        hrtc.Init.OutPut = RTC_OUTPUT_DISABLE;
        hrtc.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
        hrtc.Init.OutPutType = RTC_OUTPUT_TYPE_OPENDRAIN;
        if (HAL_RTC_Init(&hrtc) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        /**Initialize RTC and set the Time and Date 
         */
        sTime.Hours = 0x0;
        sTime.Minutes = 0x0;
        sTime.Seconds = 0x0;
        sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
        sTime.StoreOperation = RTC_STOREOPERATION_RESET;
        if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BCD) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        sDate.WeekDay = RTC_WEEKDAY_MONDAY;
        sDate.Month = RTC_MONTH_JANUARY;
        sDate.Date = 0x1;
        sDate.Year = 0x0;

        if (HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BCD) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        /**Enable the Alarm A 
         */
        sAlarm.AlarmTime.Hours = 0x0;
        sAlarm.AlarmTime.Minutes = 0x0;
        sAlarm.AlarmTime.Seconds = 0x0;
        sAlarm.AlarmTime.SubSeconds = 0x0;
        sAlarm.AlarmTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
        sAlarm.AlarmTime.StoreOperation = RTC_STOREOPERATION_RESET;
        sAlarm.AlarmMask = RTC_ALARMMASK_NONE;
        sAlarm.AlarmSubSecondMask = RTC_ALARMSUBSECONDMASK_ALL;
        sAlarm.AlarmDateWeekDaySel = RTC_ALARMDATEWEEKDAYSEL_DATE;
        sAlarm.AlarmDateWeekDay = 0x1;
        sAlarm.Alarm = RTC_ALARM_A;
        if (HAL_RTC_SetAlarm(&hrtc, &sAlarm, RTC_FORMAT_BCD) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        /**Enable the Alarm B 
         */
        sAlarm.AlarmDateWeekDay = 0x1;
        sAlarm.Alarm = RTC_ALARM_B;
        if (HAL_RTC_SetAlarm(&hrtc, &sAlarm, RTC_FORMAT_BCD) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        /**Enable the TimeStamp 
         */
        if (HAL_RTCEx_SetTimeStamp(&hrtc, RTC_TIMESTAMPEDGE_RISING, RTC_TIMESTAMPPIN_POS1) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        }

/* SAI2 init function */
static void MX_SAI2_Init(void)
        {

        hsai_BlockA2.Instance = SAI2_Block_A;
        hsai_BlockA2.Init.Protocol = SAI_FREE_PROTOCOL;
        hsai_BlockA2.Init.AudioMode = SAI_MODEMASTER_TX;
        hsai_BlockA2.Init.DataSize = SAI_DATASIZE_24;
        hsai_BlockA2.Init.FirstBit = SAI_FIRSTBIT_MSB;
        hsai_BlockA2.Init.ClockStrobing = SAI_CLOCKSTROBING_FALLINGEDGE;
        hsai_BlockA2.Init.Synchro = SAI_ASYNCHRONOUS;
        hsai_BlockA2.Init.OutputDrive = SAI_OUTPUTDRIVE_DISABLE;
        hsai_BlockA2.Init.NoDivider = SAI_MASTERDIVIDER_ENABLE;
        hsai_BlockA2.Init.FIFOThreshold = SAI_FIFOTHRESHOLD_EMPTY;
        hsai_BlockA2.Init.AudioFrequency = SAI_AUDIO_FREQUENCY_192K;
        hsai_BlockA2.Init.SynchroExt = SAI_SYNCEXT_DISABLE;
        hsai_BlockA2.Init.MonoStereoMode = SAI_STEREOMODE;
        hsai_BlockA2.Init.CompandingMode = SAI_NOCOMPANDING;
        hsai_BlockA2.Init.TriState = SAI_OUTPUT_NOTRELEASED;
        hsai_BlockA2.FrameInit.FrameLength = 8;
        hsai_BlockA2.FrameInit.ActiveFrameLength = 1;
        hsai_BlockA2.FrameInit.FSDefinition = SAI_FS_STARTFRAME;
        hsai_BlockA2.FrameInit.FSPolarity = SAI_FS_ACTIVE_LOW;
        hsai_BlockA2.FrameInit.FSOffset = SAI_FS_FIRSTBIT;
        hsai_BlockA2.SlotInit.FirstBitOffset = 0;
        hsai_BlockA2.SlotInit.SlotSize = SAI_SLOTSIZE_DATASIZE;
        hsai_BlockA2.SlotInit.SlotNumber = 1;
        hsai_BlockA2.SlotInit.SlotActive = 0x00000000;
        if (HAL_SAI_Init(&hsai_BlockA2) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        hsai_BlockB2.Instance = SAI2_Block_B;
        hsai_BlockB2.Init.Protocol = SAI_FREE_PROTOCOL;
        hsai_BlockB2.Init.AudioMode = SAI_MODESLAVE_RX;
        hsai_BlockB2.Init.DataSize = SAI_DATASIZE_24;
        hsai_BlockB2.Init.FirstBit = SAI_FIRSTBIT_MSB;
        hsai_BlockB2.Init.ClockStrobing = SAI_CLOCKSTROBING_FALLINGEDGE;
        hsai_BlockB2.Init.Synchro = SAI_SYNCHRONOUS;
        hsai_BlockB2.Init.OutputDrive = SAI_OUTPUTDRIVE_DISABLE;
        hsai_BlockB2.Init.FIFOThreshold = SAI_FIFOTHRESHOLD_EMPTY;
        hsai_BlockB2.Init.SynchroExt = SAI_SYNCEXT_DISABLE;
        hsai_BlockB2.Init.MonoStereoMode = SAI_STEREOMODE;
        hsai_BlockB2.Init.CompandingMode = SAI_NOCOMPANDING;
        hsai_BlockB2.Init.TriState = SAI_OUTPUT_NOTRELEASED;
        hsai_BlockB2.FrameInit.FrameLength = 8;
        hsai_BlockB2.FrameInit.ActiveFrameLength = 1;
        hsai_BlockB2.FrameInit.FSDefinition = SAI_FS_STARTFRAME;
        hsai_BlockB2.FrameInit.FSPolarity = SAI_FS_ACTIVE_LOW;
        hsai_BlockB2.FrameInit.FSOffset = SAI_FS_FIRSTBIT;
        hsai_BlockB2.SlotInit.FirstBitOffset = 0;
        hsai_BlockB2.SlotInit.SlotSize = SAI_SLOTSIZE_DATASIZE;
        hsai_BlockB2.SlotInit.SlotNumber = 1;
        hsai_BlockB2.SlotInit.SlotActive = 0x00000000;
        if (HAL_SAI_Init(&hsai_BlockB2) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

