oreganko/MP3_STM32/main.c
        }

/* SDMMC1 init function */
static void MX_SDMMC1_SD_Init(void)
        {

        hsd1.Instance = SDMMC1;
        hsd1.Init.ClockEdge = SDMMC_CLOCK_EDGE_RISING;
        hsd1.Init.ClockBypass = SDMMC_CLOCK_BYPASS_DISABLE;
        hsd1.Init.ClockPowerSave = SDMMC_CLOCK_POWER_SAVE_DISABLE;
        hsd1.Init.BusWide = SDMMC_BUS_WIDE_1B;
        hsd1.Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;
        hsd1.Init.ClockDiv = 0;

        }

/* SPDIFRX init function */
static void MX_SPDIFRX_Init(void)
        {

        hspdif.Instance = SPDIFRX;
        hspdif.Init.InputSelection = SPDIFRX_INPUT_IN0;
        hspdif.Init.Retries = SPDIFRX_MAXRETRIES_NONE;
        hspdif.Init.WaitForActivity = SPDIFRX_WAITFORACTIVITY_OFF;
        hspdif.Init.ChannelSelection = SPDIFRX_CHANNEL_A;
        hspdif.Init.DataFormat = SPDIFRX_DATAFORMAT_LSB;
        hspdif.Init.StereoMode = SPDIFRX_STEREOMODE_DISABLE;
        hspdif.Init.PreambleTypeMask = SPDIFRX_PREAMBLETYPEMASK_OFF;
        hspdif.Init.ChannelStatusMask = SPDIFRX_CHANNELSTATUS_OFF;
        hspdif.Init.ValidityBitMask = SPDIFRX_VALIDITYMASK_OFF;
        hspdif.Init.ParityErrorMask = SPDIFRX_PARITYERRORMASK_OFF;
        if (HAL_SPDIFRX_Init(&hspdif) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        }

/* SPI2 init function */
static void MX_SPI2_Init(void)
        {

        /* SPI2 parameter configuration*/
        hspi2.Instance = SPI2;
        hspi2.Init.Mode = SPI_MODE_MASTER;
        hspi2.Init.Direction = SPI_DIRECTION_2LINES;
        hspi2.Init.DataSize = SPI_DATASIZE_4BIT;
        hspi2.Init.CLKPolarity = SPI_POLARITY_LOW;
        hspi2.Init.CLKPhase = SPI_PHASE_1EDGE;
        hspi2.Init.NSS = SPI_NSS_SOFT;
        hspi2.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_2;
        hspi2.Init.FirstBit = SPI_FIRSTBIT_MSB;
        hspi2.Init.TIMode = SPI_TIMODE_DISABLE;
        hspi2.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
        hspi2.Init.CRCPolynomial = 7;
        hspi2.Init.CRCLength = SPI_CRC_LENGTH_DATASIZE;
        hspi2.Init.NSSPMode = SPI_NSS_PULSE_ENABLE;
        if (HAL_SPI_Init(&hspi2) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        }

/* TIM1 init function */
static void MX_TIM1_Init(void)
        {

        TIM_ClockConfigTypeDef sClockSourceConfig;
        TIM_MasterConfigTypeDef sMasterConfig;
        TIM_OC_InitTypeDef sConfigOC;
        TIM_BreakDeadTimeConfigTypeDef sBreakDeadTimeConfig;

        htim1.Instance = TIM1;
        htim1.Init.Prescaler = 0;
        htim1.Init.CounterMode = TIM_COUNTERMODE_UP;
        htim1.Init.Period = 0;
        htim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
        htim1.Init.RepetitionCounter = 0;
        htim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
        if (HAL_TIM_Base_Init(&htim1) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
        if (HAL_TIM_ConfigClockSource(&htim1, &sClockSourceConfig) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        if (HAL_TIM_PWM_Init(&htim1) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
        sMasterConfig.MasterOutputTrigger2 = TIM_TRGO2_RESET;
        sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
        if (HAL_TIMEx_MasterConfigSynchronization(&htim1, &sMasterConfig) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        sConfigOC.OCMode = TIM_OCMODE_PWM1;
        sConfigOC.Pulse = 0;
        sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
        sConfigOC.OCNPolarity = TIM_OCNPOLARITY_HIGH;
        sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
        sConfigOC.OCIdleState = TIM_OCIDLESTATE_RESET;
        sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_RESET;
        if (HAL_TIM_PWM_ConfigChannel(&htim1, &sConfigOC, TIM_CHANNEL_1) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        sBreakDeadTimeConfig.OffStateRunMode = TIM_OSSR_DISABLE;
        sBreakDeadTimeConfig.OffStateIDLEMode = TIM_OSSI_DISABLE;
        sBreakDeadTimeConfig.LockLevel = TIM_LOCKLEVEL_OFF;
        sBreakDeadTimeConfig.DeadTime = 0;
        sBreakDeadTimeConfig.BreakState = TIM_BREAK_DISABLE;
        sBreakDeadTimeConfig.BreakPolarity = TIM_BREAKPOLARITY_HIGH;
        sBreakDeadTimeConfig.BreakFilter = 0;
        sBreakDeadTimeConfig.Break2State = TIM_BREAK2_DISABLE;
        sBreakDeadTimeConfig.Break2Polarity = TIM_BREAK2POLARITY_HIGH;
        sBreakDeadTimeConfig.Break2Filter = 0;
        sBreakDeadTimeConfig.AutomaticOutput = TIM_AUTOMATICOUTPUT_DISABLE;
        if (HAL_TIMEx_ConfigBreakDeadTime(&htim1, &sBreakDeadTimeConfig) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        HAL_TIM_MspPostInit(&htim1);

        }

/* TIM2 init function */
static void MX_TIM2_Init(void)
        {

        TIM_ClockConfigTypeDef sClockSourceConfig;
        TIM_MasterConfigTypeDef sMasterConfig;
        TIM_OC_InitTypeDef sConfigOC;

        htim2.Instance = TIM2;
        htim2.Init.Prescaler = 0;
        htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
        htim2.Init.Period = 0;
        htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
        htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
        if (HAL_TIM_Base_Init(&htim2) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
        if (HAL_TIM_ConfigClockSource(&htim2, &sClockSourceConfig) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        if (HAL_TIM_PWM_Init(&htim2) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
        sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
        if (HAL_TIMEx_MasterConfigSynchronization(&htim2, &sMasterConfig) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

