oreganko/MP3_STM32/main.c
        HAL_TIM_MspPostInit(&htim12);

        }

/* USART1 init function */
static void MX_USART1_UART_Init(void)
        {

        huart1.Instance = USART1;
        huart1.Init.BaudRate = 115200;
        huart1.Init.WordLength = UART_WORDLENGTH_8B;
        huart1.Init.StopBits = UART_STOPBITS_1;
        huart1.Init.Parity = UART_PARITY_NONE;
        huart1.Init.Mode = UART_MODE_TX_RX;
        huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
        huart1.Init.OverSampling = UART_OVERSAMPLING_16;
        huart1.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
        huart1.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
        if (HAL_UART_Init(&huart1) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        }

/* USART6 init function */
static void MX_USART6_UART_Init(void)
        {

        huart6.Instance = USART6;
        huart6.Init.BaudRate = 115200;
        huart6.Init.WordLength = UART_WORDLENGTH_8B;
        huart6.Init.StopBits = UART_STOPBITS_1;
        huart6.Init.Parity = UART_PARITY_NONE;
        huart6.Init.Mode = UART_MODE_TX_RX;
        huart6.Init.HwFlowCtl = UART_HWCONTROL_NONE;
        huart6.Init.OverSampling = UART_OVERSAMPLING_16;
        huart6.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
        huart6.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
        if (HAL_UART_Init(&huart6) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        }

/* FMC initialization function */
static void MX_FMC_Init(void)
        {
        FMC_SDRAM_TimingTypeDef SdramTiming;

        /** Perform the SDRAM1 memory initialization sequence
         */
        hsdram1.Instance = FMC_SDRAM_DEVICE;
        /* hsdram1.Init */
        hsdram1.Init.SDBank = FMC_SDRAM_BANK1;
        hsdram1.Init.ColumnBitsNumber = FMC_SDRAM_COLUMN_BITS_NUM_8;
        hsdram1.Init.RowBitsNumber = FMC_SDRAM_ROW_BITS_NUM_12;
        hsdram1.Init.MemoryDataWidth = FMC_SDRAM_MEM_BUS_WIDTH_16;
        hsdram1.Init.InternalBankNumber = FMC_SDRAM_INTERN_BANKS_NUM_4;
        hsdram1.Init.CASLatency = FMC_SDRAM_CAS_LATENCY_3;
        hsdram1.Init.WriteProtection = FMC_SDRAM_WRITE_PROTECTION_DISABLE;
        hsdram1.Init.SDClockPeriod = FMC_SDRAM_CLOCK_PERIOD_2;
        hsdram1.Init.ReadBurst = FMC_SDRAM_RBURST_ENABLE;
        hsdram1.Init.ReadPipeDelay = FMC_SDRAM_RPIPE_DELAY_0;
        /* SdramTiming */
        SdramTiming.LoadToActiveDelay = 2;
        SdramTiming.ExitSelfRefreshDelay = 7;
        SdramTiming.SelfRefreshTime = 4;
        SdramTiming.RowCycleDelay = 7;
        SdramTiming.WriteRecoveryTime = 3;
        SdramTiming.RPDelay = 2;
        SdramTiming.RCDDelay = 2;

        if (HAL_SDRAM_Init(&hsdram1, &SdramTiming) != HAL_OK)
        {
        _Error_Handler(__FILE__, __LINE__);
        }

        }

/** Configure pins as 
 * Analog 
 * Input 
 * Output
 * EVENT_OUT
 * EXTI
 PB5   ------> USB_OTG_HS_ULPI_D7
 PH4   ------> USB_OTG_HS_ULPI_NXT
 PB13   ------> USB_OTG_HS_ULPI_D6
 PB12   ------> USB_OTG_HS_ULPI_D5
 PC0   ------> USB_OTG_HS_ULPI_STP
 PC2   ------> USB_OTG_HS_ULPI_DIR
 PA5   ------> USB_OTG_HS_ULPI_CK
 PB10   ------> USB_OTG_HS_ULPI_D3
 PA3   ------> USB_OTG_HS_ULPI_D0
 PB1   ------> USB_OTG_HS_ULPI_D2
 PB0   ------> USB_OTG_HS_ULPI_D1
 PB11   ------> USB_OTG_HS_ULPI_D4
 */
static void MX_GPIO_Init(void)
        {

        GPIO_InitTypeDef GPIO_InitStruct;

        /* GPIO Ports Clock Enable */
        __HAL_RCC_GPIOE_CLK_ENABLE();
        __HAL_RCC_GPIOG_CLK_ENABLE();
        __HAL_RCC_GPIOB_CLK_ENABLE();
        __HAL_RCC_GPIOD_CLK_ENABLE();
        __HAL_RCC_GPIOC_CLK_ENABLE();
        __HAL_RCC_GPIOA_CLK_ENABLE();
        __HAL_RCC_GPIOJ_CLK_ENABLE();
        __HAL_RCC_GPIOI_CLK_ENABLE();
        __HAL_RCC_GPIOK_CLK_ENABLE();
        __HAL_RCC_GPIOF_CLK_ENABLE();
        __HAL_RCC_GPIOH_CLK_ENABLE();

        /*Configure GPIO pin Output Level */
        HAL_GPIO_WritePin(OTG_FS_PowerSwitchOn_GPIO_Port, OTG_FS_PowerSwitchOn_Pin, GPIO_PIN_SET);

        /*Configure GPIO pin Output Level */
        HAL_GPIO_WritePin(GPIOI, ARDUINO_D7_Pin|ARDUINO_D8_Pin, GPIO_PIN_RESET);

        /*Configure GPIO pin Output Level */
        HAL_GPIO_WritePin(LCD_BL_CTRL_GPIO_Port, LCD_BL_CTRL_Pin, GPIO_PIN_SET);

        /*Configure GPIO pin Output Level */
        HAL_GPIO_WritePin(LCD_DISP_GPIO_Port, LCD_DISP_Pin, GPIO_PIN_SET);

        /*Configure GPIO pin Output Level */
        HAL_GPIO_WritePin(DCMI_PWR_EN_GPIO_Port, DCMI_PWR_EN_Pin, GPIO_PIN_RESET);

        /*Configure GPIO pin Output Level */
        HAL_GPIO_WritePin(GPIOG, ARDUINO_D4_Pin|ARDUINO_D2_Pin|EXT_RST_Pin, GPIO_PIN_RESET);

        /*Configure GPIO pin : OTG_HS_OverCurrent_Pin */
        GPIO_InitStruct.Pin = OTG_HS_OverCurrent_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(OTG_HS_OverCurrent_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_D7_Pin ULPI_D6_Pin ULPI_D5_Pin ULPI_D3_Pin 
                           ULPI_D2_Pin ULPI_D1_Pin ULPI_D4_Pin */
        GPIO_InitStruct.Pin = ULPI_D7_Pin|ULPI_D6_Pin|ULPI_D5_Pin|ULPI_D3_Pin
        |ULPI_D2_Pin|ULPI_D1_Pin|ULPI_D4_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
        GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
        HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

        /*Configure GPIO pin : OTG_FS_VBUS_Pin */
        GPIO_InitStruct.Pin = OTG_FS_VBUS_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(OTG_FS_VBUS_GPIO_Port, &GPIO_InitStruct);

        /*Configure GPIO pin : Audio_INT_Pin */
        GPIO_InitStruct.Pin = Audio_INT_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(Audio_INT_GPIO_Port, &GPIO_InitStruct);

        /*Configure GPIO pin : OTG_FS_PowerSwitchOn_Pin */
        GPIO_InitStruct.Pin = OTG_FS_PowerSwitchOn_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
        HAL_GPIO_Init(OTG_FS_PowerSwitchOn_GPIO_Port, &GPIO_InitStruct);

        /*Configure GPIO pins : ARDUINO_D7_Pin ARDUINO_D8_Pin LCD_DISP_Pin */
        GPIO_InitStruct.Pin = ARDUINO_D7_Pin|ARDUINO_D8_Pin|LCD_DISP_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
        HAL_GPIO_Init(GPIOI, &GPIO_InitStruct);

        /*Configure GPIO pin : uSD_Detect_Pin */
        GPIO_InitStruct.Pin = uSD_Detect_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(uSD_Detect_GPIO_Port, &GPIO_InitStruct);

        /*Configure GPIO pin : LCD_BL_CTRL_Pin */
        GPIO_InitStruct.Pin = LCD_BL_CTRL_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
        HAL_GPIO_Init(LCD_BL_CTRL_GPIO_Port, &GPIO_InitStruct);

        /*Configure GPIO pin : OTG_FS_OverCurrent_Pin */
        GPIO_InitStruct.Pin = OTG_FS_OverCurrent_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(OTG_FS_OverCurrent_GPIO_Port, &GPIO_InitStruct);

