oreganko/MP3_STM32/main.c
        /*Configure GPIO pins : TP3_Pin NC2_Pin */
        GPIO_InitStruct.Pin = TP3_Pin|NC2_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

        /*Configure GPIO pin : DCMI_PWR_EN_Pin */
        GPIO_InitStruct.Pin = DCMI_PWR_EN_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
        HAL_GPIO_Init(DCMI_PWR_EN_GPIO_Port, &GPIO_InitStruct);

        /*Configure GPIO pin : LCD_INT_Pin */
        GPIO_InitStruct.Pin = LCD_INT_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(LCD_INT_GPIO_Port, &GPIO_InitStruct);

        /*Configure GPIO pin : ULPI_NXT_Pin */
        GPIO_InitStruct.Pin = ULPI_NXT_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
        GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
        HAL_GPIO_Init(ULPI_NXT_GPIO_Port, &GPIO_InitStruct);

        /*Configure GPIO pins : ARDUINO_D4_Pin ARDUINO_D2_Pin EXT_RST_Pin */
        GPIO_InitStruct.Pin = ARDUINO_D4_Pin|ARDUINO_D2_Pin|EXT_RST_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
        HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

        /*Configure GPIO pins : ULPI_STP_Pin ULPI_DIR_Pin */
        GPIO_InitStruct.Pin = ULPI_STP_Pin|ULPI_DIR_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
        GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
        HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

        /*Configure GPIO pin : RMII_RXER_Pin */
        GPIO_InitStruct.Pin = RMII_RXER_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(RMII_RXER_GPIO_Port, &GPIO_InitStruct);

        /*Configure GPIO pins : ULPI_CLK_Pin ULPI_D0_Pin */
        GPIO_InitStruct.Pin = ULPI_CLK_Pin|ULPI_D0_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
        GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
        HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

        }

        /* USER CODE BEGIN 4 */
        #if ENABLE_NETWORK

static char response[500];

//based on available code examples
static void http_server_serve(struct netconn *conn)
        {
        struct netbuf *inbuf;
        err_t recv_err;
        char* buf;
        u16_t buflen;
  
  /* Read the data from the port, blocking if nothing yet there. 
   We assume the request (the part we care about) is in one netbuf */
        recv_err = netconn_recv(conn, &inbuf);

        if (recv_err == ERR_OK)
        {
        if (netconn_err(conn) == ERR_OK)
        {
        netbuf_data(inbuf, (void**)&buf, &buflen);
    
      /* Is this an HTTP GET command? (only check the first 5 chars, since
      there are other formats for GET, and we're keeping it very simple )*/
        if ((buflen >=5) && (strncmp(buf, "GET /", 5) == 0))
        {
        response[0] = 0;

        strcpy(response, "HTTP/1.1 200 OK\r\n\
        Content-Type: text/html\r\n\
        Connnection: close\r\n\r\n\
<!DOCTYPE HTML>\r\n");

        #if 0
        strcat(response,"<html>\r\n\
<meta http-equiv=\"refresh\" content=\"10\">");
        #endif

        strcat(response,"<title>Prosta strona WWW</title>");
        strcat(response,"<h1>H1 Header</h1>");

        strcat(response,"A to jest tekst na stronie");
        netconn_write(conn, response, sizeof(response), NETCONN_NOCOPY);
        }
        }
        }
        /* Close the connection (server closes in HTTP) */
        netconn_close(conn);
  
  /* Delete the buffer (netconn_recv gives us ownership,
   so we have to make sure to deallocate the buffer) */
        netbuf_delete(inbuf);
        }


//based on available code examples
static void http_server_netconn_thread(void const *arg)
        {
        struct netconn *conn, *newconn;
        err_t err, accept_err;

        xprintf("http_server_netconn_thread\n");

        /* Create a new TCP connection handle */
        conn = netconn_new(NETCONN_TCP);

        if (conn!= NULL)
        {
        /* Bind to port 80 (HTTP) with default IP address */
        err = netconn_bind(conn, NULL, 80);

        if (err == ERR_OK)
        {
        /* Put the connection into LISTEN state */
        netconn_listen(conn);

        while(1)
        {
        /* accept any icoming connection */
        accept_err = netconn_accept(conn, &newconn);
        if(accept_err == ERR_OK)
        {
        /* serve connection */
        http_server_serve(newconn);

        /* delete connection */
        netconn_delete(newconn);
        }
        }
        }
        }
        }

        #endif //ENABLE_NETWORK


//defining
#define SONGS 20
#define DISK "1:"


static uint8_t player_state1 = 2;
int volume = 70;
int current_song = 0;
int songs = 0;
char titles[SONGS][100];
FRESULT res;

 #define AUDIO_OUT_BUFFER_SIZE                      8192
enum {
        BUFFER_OFFSET_NONE = 0,
        BUFFER_OFFSET_HALF,
        BUFFER_OFFSET_FULL,
        };

        uint8_t buff[AUDIO_OUT_BUFFER_SIZE];
static FIL file;
        extern ApplicationTypeDef Appli_state;
static uint8_t buf_offs = BUFFER_OFFSET_NONE;
static uint32_t fpos = 0;

        char play_buffer[AUDIO_OUT_BUFFER_SIZE];
        unsigned char input_buffer[AUDIO_OUT_BUFFER_SIZE];
        unsigned char *input_buffer_pointer;
        short spare_buffer[AUDIO_OUT_BUFFER_SIZE/2];
        short *spare_buffer_pointer;
        int spare_buffer_offset = 0;
        int bytes_in_input_buffer = 0;
        MP3FrameInfo mp3_frame_info;
		HMP3Decoder decoder;
		int title_offset = 0;

        void BSP_AUDIO_OUT_TransferComplete_CallBack(void)
        {
        buf_offs = BUFFER_OFFSET_FULL;
        }

        void BSP_AUDIO_OUT_HalfTransfer_CallBack(void)
        {
        buf_offs = BUFFER_OFFSET_HALF;
        }

       void print_title() {
		if(strlen(titles[current_song])>=22){
			uint8_t title[22];
			memcpy(title, titles[current_song] + title_offset, 22);
			BSP_LCD_SelectLayer(1);
			BSP_LCD_SetTextColor(LCD_COLOR_DARKBLUE);
			BSP_LCD_DisplayStringAt(0, LCD_Y_SIZE - 30, title, LEFT_MODE);
			title_offset = (title_offset + 1)%(strlen(titles[current_song])-21);
			}
			else{
				uint8_t title[22] = "                      ";
				memcpy(title, titles[current_song], strlen(titles[current_song]));
				BSP_LCD_SelectLayer(1);
				BSP_LCD_SetTextColor(LCD_COLOR_DARKBLUE);
				BSP_LCD_DisplayStringAt(0, LCD_Y_SIZE - 30, title, LEFT_MODE);
				
