oreganko/MP3_STM32/main.c
				xprintf("%s    %d\n", title, strlen(titles[current_song]));
				}
		}
		
	void decode(int play_offset){
		uint32_t bytes_read = 0;
		
		if (f_read(&file, input_buffer_pointer, AUDIO_OUT_BUFFER_SIZE - bytes_in_input_buffer, (void *) &bytes_read) != FR_OK) {
			BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
			xprintf("file reading error\n");
		}
		bytes_in_input_buffer += bytes_read;
		input_buffer_pointer = input_buffer;

		while(spare_buffer_offset < AUDIO_OUT_BUFFER_SIZE / 4){
			int offset = MP3FindSyncWord((unsigned char *) input_buffer_pointer, bytes_in_input_buffer);
			if(offset == -1){
			xprintf("Offset is -1 :(");
			}
			//We move pointer to find first frame
			bytes_in_input_buffer -= (offset);
			input_buffer_pointer += (offset);
			//int err = MP3GetNextFrameInfo(decoder, &mp3_frame_info, (unsigned char*) &input_buffer_pointer);
			//xprintf("err is %d\n", err);
			//We decode first frame - use input buffer for this. Decoded data goes to spare_buffer
			int is_error = MP3Decode(decoder, (unsigned char**) &input_buffer_pointer, (int*) &bytes_in_input_buffer, spare_buffer_pointer,0);
			if(is_error){
				xprintf("Error while decoding %d.\n", is_error);
				break;
			}
			//Need to know how many bits were processed
			
			MP3GetLastFrameInfo(decoder, &mp3_frame_info);
			spare_buffer_offset += mp3_frame_info.outputSamps;
			spare_buffer_pointer = spare_buffer + spare_buffer_offset;

		}
		//move data in input buffer to its beginning
		memcpy(input_buffer, input_buffer_pointer, bytes_in_input_buffer);
		//input_buffer_pointer has to show place where new data can be put
		input_buffer_pointer = input_buffer + bytes_in_input_buffer;

		//We want to play music so we fullfill half of play_buffer and argument play_offset shows which one half
		memcpy(play_buffer + play_offset, spare_buffer, AUDIO_OUT_BUFFER_SIZE/2);
		//We have copied audio_out_buffer_size/4 of spare_buffer to play_buffer so we delete it
		memcpy(spare_buffer, &spare_buffer[AUDIO_OUT_BUFFER_SIZE/4], (spare_buffer_offset - AUDIO_OUT_BUFFER_SIZE/4) * 2);
		spare_buffer_offset -= AUDIO_OUT_BUFFER_SIZE/4;
		spare_buffer_pointer = spare_buffer + spare_buffer_offset;
		buf_offs = BUFFER_OFFSET_NONE;
}

void play_new() {
		xprintf("Song %s of current song: %d", titles[current_song], current_song);
		title_offset = 0;
        res = f_open(&file,titles[current_song],FA_READ);
        if(res==FR_OK)
        {
        xprintf("mp3 file open OK\n");
        }
        else
        {
        xprintf("wave file open ERROR, res = %d\n",res);
        //f_disp_res(res);
        while(1);
        }
        spare_buffer_pointer = spare_buffer;
        input_buffer_pointer = input_buffer;
		
		BSP_AUDIO_OUT_Play((uint16_t*)&play_buffer[0],AUDIO_OUT_BUFFER_SIZE);
        decode(0);
        decode(AUDIO_OUT_BUFFER_SIZE/2);
        player_state1 = 1;
        
        fpos = 0;
        buf_offs = BUFFER_OFFSET_NONE;
	}

void end_song() {
	BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
	f_close(&file);
    printf("EndOfSong");
    player_state1 = 0;
	spare_buffer_offset = 0;
    bytes_in_input_buffer = 0;
	buf_offs = BUFFER_OFFSET_NONE;
}

int volume_up(){
    if (BSP_AUDIO_OUT_SetVolume(volume < 91 ? volume += 10 : volume) != AUDIO_OK)
        {
            xprintf("ERROR: Failed to set audio volume\n");
			
            return -1;
        }
		xprintf("v: %d", volume);
		draw_current_volume(volume);
        return 0;
}

int volume_down(){
    if (BSP_AUDIO_OUT_SetVolume(volume > 9 ? volume -= 10 : volume) != AUDIO_OK)
        {
            xprintf("ERROR: Failed to set audio volume\n");
       
			return -1;
        }
		xprintf("v: %d", volume);
		draw_current_volume(volume);
        return 0;
}


///funkcja wykrywajaca dotyk
void detect_touch(TS_StateTypeDef touch){
    unsigned x = touch.touchX[0];
    unsigned y = touch.touchY[0];
    if(inRange(x0, x1, x) && inRange(y3, y4, y)){
        //stop_song();
        xprintf("song stopped\n");
		draw_stopped_background();
		end_song();
		current_song = 0;
		player_state1 = 2;
    }
    else if(inRange(x2, x3, x) && inRange(y3, y4, y)){
        //play_prev_song();
		current_song = current_song > 0 ? current_song - 1 : songs - 1;
		end_song();
		play_new();
        xprintf("prev song\n");
    }
    else if(inRange(x4, x5, x) && inRange(y1, y5, y)){
		if(player_state1 == 2){
			play_new();
			draw_playing_background();
			xprintf("song started\n");
			}
        else if(player_state1){ //pause_song(); 
			BSP_AUDIO_OUT_Pause();
			draw_stopped_background();
			player_state1 = 0;
			xprintf("song paused\n"); }
        else { //continue_song(); 
			BSP_AUDIO_OUT_Resume();
			draw_playing_background();
            player_state1 = 1;
			xprintf("song continued\n"); }
    }
    else if(inRange(x6, x7, x) && inRange(y3, y4, y)){
        //play_next_song();
		current_song = (current_song + 1) % songs;
		end_song();
		play_new();
        xprintf("next song\n");
    }
    else if(inRange(x8, x9, x)){
        if(inRange(y0, y2, y)){
            volume_up();
            xprintf("volume up\n");
        }
        else if(inRange(y6, y7, y)){
            volume_down();
            xprintf("volume down\n");
        }
    }
}



        /* USER CODE END 4 */

        /* USER CODE BEGIN Header_StartDefaultTask */
/**
 * @brief  Function implementing the defaultTask thread.
 * @param  argument: Not used 
 * @retval None
 */
        /* USER CODE END Header_StartDefaultTask */
        void StartDefaultTask(void const * argument)
        {
        /* init code for FATFS */
        MX_FATFS_Init();

        /* init code for USB_HOST */
        MX_USB_HOST_Init();

        /* init code for LWIP */
        #if ENABLE_NETWORK
        MX_LWIP_Init();
        #endif

        /* USER CODE BEGIN 5 */
        #if ENABLE_NETWORK
        osThreadDef(netconn_thread, http_server_netconn_thread, osPriorityNormal, 0, 1024);
        netconn_thread_handle = osThreadCreate(osThread(netconn_thread), NULL);
        #endif

        vTaskDelay(1000);

        lcd_start();


        xprintf("waiting for USB mass storage\n");

        do
        {
        xprintf(".");
        vTaskDelay(250);
        }while(Appli_state != APPLICATION_READY);

        xprintf("initializing audio codec...\n");

        
        FRESULT f_result;
        DIR directory;
        FILINFO file_info;

//finding mp3 file
        f_result = f_findfirst(&directory, &file_info, DISK, "*.mp3");
        while(f_result== FR_OK && file_info.fname[0] && songs < SONGS) {
        char path[50];
        strcpy(path, DISK);
        strcpy(path, "/");
        strcpy(path, file_info.fname);
        strcpy(titles[songs], path);
        f_result = f_findnext(&directory, &file_info);
        songs++;
        }
        f_closedir(&directory);
        draw_stopped_background();
		xprintf("SONGS %d\n", songs);
		for(int i = 0; i<songs; i++) {
			xprintf("SONG no %d: %s\n", i, titles[i]);
			}

        if(BSP_AUDIO_OUT_Init(OUTPUT_DEVICE_HEADPHONE1, volume, AUDIO_FREQUENCY_44K) == 0)
        {
        xprintf("audio init OK\n");
        }
        else
        {
        xprintf("audio init ERROR\n");
        }
        BSP_AUDIO_OUT_SetAudioFrameSlot(CODEC_AUDIOFRAME_SLOT_02);
		
		
        decoder = MP3InitDecoder();
		int i = 0;
        /* Infinite loop */
        for(;;)
        {
		i = (i + 1) % 200;
		if(i == 0)
			{print_title();}
		BSP_TS_GetState(&TS_State);
		if(TS_State.touchDetected){
			detect_touch(TS_State);
			vTaskDelay(100);
		}

