oreganko/MP3_STM32/main.c
        if(player_state1 == 1)
        {
        if (buf_offs == BUFFER_OFFSET_HALF) {
        decode(0);
        }
        if (buf_offs == BUFFER_OFFSET_FULL) {
        decode(AUDIO_OUT_BUFFER_SIZE / 2);
        }
        if (bytes_in_input_buffer == 0) {
		end_song();
        current_song = (current_song + 1)%songs;
		play_new();
        }

        }


        vTaskDelay(1);

        }
        /* USER CODE END 5 */
        }

/**
 * @brief  Period elapsed callback in non blocking mode
 * @note   This function is called  when TIM6 interrupt took place, inside
 * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
 * a global variable "uwTick" used as application time base.
 * @param  htim : TIM handle
 * @retval None
 */
        void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
        {
        /* USER CODE BEGIN Callback 0 */

        /* USER CODE END Callback 0 */
        if (htim->Instance == TIM6) {
        HAL_IncTick();
        }
        /* USER CODE BEGIN Callback 1 */

        /* USER CODE END Callback 1 */
        }

/**
 * @brief  This function is executed in case of error occurrence.
 * @param  file: The file name as string.
 * @param  line: The line in file as a number.
 * @retval None
 */
        void _Error_Handler(char *file, int line)
        {
        /* USER CODE BEGIN Error_Handler_Debug */
        /* User can add his own implementation to report the HAL error return state */
        while(1)
        {
        }
        /* USER CODE END Error_Handler_Debug */
        }

        #ifdef  USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
        void assert_failed(uint8_t* file, uint32_t line)
        {
        /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
        /* USER CODE END 6 */
        }
        #endif /* USE_FULL_ASSERT */

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
